ARMmbed/mbed-os/targets/TARGET_Silicon_Labs/TARGET_EFM32/emlib/inc/em_csen.h
/***************************************************************************//**
 * @file em_csen.h
 * @brief Capacitive Sense Module (CSEN) peripheral API
 * @version 5.3.3
 *******************************************************************************
 * # License
 * <b>Copyright 2016 Silicon Laboratories, Inc. http://www.silabs.com</b>
 *******************************************************************************
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 * DISCLAIMER OF WARRANTY/LIMITATION OF REMEDIES: Silicon Labs has no
 * obligation to support this Software. Silicon Labs is providing the
 * Software "AS IS", with no express or implied warranties of any kind,
 * including, but not limited to, any implied warranties of merchantability
 * or fitness for any particular purpose or warranties against infringement
 * of any proprietary rights of a third party.
 *
 * Silicon Labs will not be liable for any consequential, incidental, or
 * special damages, or any other relief, or for any claim by any third party,
 * arising from your use of this Software.
 *
 ******************************************************************************/

#ifndef EM_CSEN_H
#define EM_CSEN_H

#include "em_device.h"
#if defined(CSEN_COUNT) && (CSEN_COUNT > 0)

#include <stdbool.h>
#include "em_bus.h"

#ifdef __cplusplus
extern "C" {
#endif

/***************************************************************************//**
 * @addtogroup emlib
 * @{
 ******************************************************************************/

/***************************************************************************//**
 * @addtogroup CSEN
 * @brief Capacitive Sense (CSEN) Peripheral API
 *
 * @details
 *  This module provides functions for controlling the capacitive sense
 *  peripheral of Silicon Labs 32-bit MCUs and SoCs. The CSEN includes a
 *  capacitance-to-digital circuit that measures capacitance on selected
 *  inputs. Measurements are performed using either a successive approximation
 *  register (SAR) or a delta modulator (DM) analog to digital converter.
 *
 *  The CSEN can be configured to measure capacitance on a single port pin
 *  or to automatically measure multiple port pins in succession using scan
 *  mode. Also several port pins can be shorted together to measure the
 *  combined capacitance.
 *
 *  The CSEN includes an accumulator which can be configured to average
 *  multiple conversions on the selected input. Additionally, an exponential
 *  moving average (EMA) calculator is included to provide data smoothing.
 *  A comparator is also included and can be used to terminate a continuous
 *  conversion when the configured threshold condition is met.
 *
 *  The following example shows how to intialize and start a single
 *  conversion on one input:
 *
 *  @include em_csen_single.c
 *
 * @{
 ******************************************************************************/

/*******************************************************************************
 ********************************   ENUMS   ************************************
 ******************************************************************************/

/** Comparator Mode. Selects the operation of the digital comparator. */
typedef enum {
    /** Comparator is disabled. */
    csenCmpModeDisabled    = 0,

    /** Comparator trips when the result is greater than the threshold. */
    csenCmpModeGreater     = CSEN_CTRL_CMPEN | CSEN_CTRL_CMPPOL_GT,

    /** Comparator trips when the result is less or equal to the threshold. */
    csenCmpModeLessOrEqual = CSEN_CTRL_CMPEN | CSEN_CTRL_CMPPOL_LTE,

    /** Comparator trips when the EMA is within the threshold window. */
    csenCmpModeEMAWindow   = CSEN_CTRL_EMACMPEN,
} CSEN_CmpMode_TypeDef;

/** Converter Select. Determines the converter operational mode. */
typedef enum {
    /** Successive Approximation (SAR) converter. */
    csenConvSelSAR     = CSEN_CTRL_CONVSEL_SAR,

    /** Successive Approximation (SAR) converter with low freq attenuation. */
    csenConvSelSARChop = CSEN_CTRL_CONVSEL_SAR | CSEN_CTRL_CHOPEN_ENABLE,

    /** Delta Modulation (DM) converter. */
    csenConvSelDM      = CSEN_CTRL_CONVSEL_DM,

    /** Delta Modulation (DM) converter with low frequency attenuation. */
    csenConvSelDMChop  = CSEN_CTRL_CONVSEL_DM | CSEN_CTRL_CHOPEN_ENABLE,
} CSEN_ConvSel_TypeDef;

/** Sample Mode. Determines how inputs are sampled for a conversion. */
typedef enum {
    /** Convert multiple inputs shorted together and stop. */
    csenSampleModeBonded     = CSEN_CTRL_CM_SGL | CSEN_CTRL_MCEN_ENABLE,

    /** Convert one input and stop. */
    csenSampleModeSingle     = CSEN_CTRL_CM_SGL,

    /** Convert multiple inputs one at a time and stop. */
    csenSampleModeScan       = CSEN_CTRL_CM_SCAN,

    /** Continuously convert multiple inputs shorted together. */
    csenSampleModeContBonded = CSEN_CTRL_CM_CONTSGL | CSEN_CTRL_MCEN_ENABLE,

    /** Continuously convert one input. */
    csenSampleModeContSingle = CSEN_CTRL_CM_CONTSGL,

    /** Continuously convert multiple inputs one at a time. */
    csenSampleModeContScan   = CSEN_CTRL_CM_CONTSCAN,
} CSEN_SampleMode_TypeDef;

/** Start Trigger Select. */
typedef enum {
    csenTrigSelPRS   = _CSEN_CTRL_STM_PRS,   /**< PRS system. */
    csenTrigSelTimer = _CSEN_CTRL_STM_TIMER, /**< CSEN PC timer. */
    csenTrigSelStart = _CSEN_CTRL_STM_START, /**< Start bit. */
} CSEN_TrigSel_TypeDef;

/** Accumulator Mode Select. */
typedef enum {
    csenAccMode1  = _CSEN_CTRL_ACU_ACC1,  /**< Accumulate 1 sample. */
    csenAccMode2  = _CSEN_CTRL_ACU_ACC2,  /**< Accumulate 2 samples. */
    csenAccMode4  = _CSEN_CTRL_ACU_ACC4,  /**< Accumulate 4 samples. */
    csenAccMode8  = _CSEN_CTRL_ACU_ACC8,  /**< Accumulate 8 samples. */
    csenAccMode16 = _CSEN_CTRL_ACU_ACC16, /**< Accumulate 16 samples. */
    csenAccMode32 = _CSEN_CTRL_ACU_ACC32, /**< Accumulate 32 samples. */
    csenAccMode64 = _CSEN_CTRL_ACU_ACC64, /**< Accumulate 64 samples. */
} CSEN_AccMode_TypeDef;

/** Successive Approximation (SAR) Conversion Resolution. */
typedef enum {
    csenSARRes10 = _CSEN_CTRL_SARCR_CLK10, /**< 10-bit resolution. */
    csenSARRes12 = _CSEN_CTRL_SARCR_CLK12, /**< 12-bit resolution. */
    csenSARRes14 = _CSEN_CTRL_SARCR_CLK14, /**< 14-bit resolution. */
    csenSARRes16 = _CSEN_CTRL_SARCR_CLK16, /**< 16-bit resolution. */
} CSEN_SARRes_TypeDef;

/** Delta Modulator (DM) Conversion Resolution. */
typedef enum {
    csenDMRes10 = _CSEN_DMCFG_CRMODE_DM10, /**< 10-bit resolution. */
    csenDMRes12 = _CSEN_DMCFG_CRMODE_DM12, /**< 12-bit resolution. */
    csenDMRes14 = _CSEN_DMCFG_CRMODE_DM14, /**< 14-bit resolution. */
    csenDMRes16 = _CSEN_DMCFG_CRMODE_DM16, /**< 16-bit resolution. */
} CSEN_DMRes_TypeDef;

